[
  {
    "text": "If you know of any businesses supporting the strike tomorrow, drop their names below so we can support them!",
    "url": ""
  },
  {
    "text": "Fillory Yarn in San Jose is participating! [Their post](https://www.instagram.com/p/DUFTIZWkhMz/?igsh=NTc4MTIwNjQ2YQ==) [removed] Your post has been removed due to linking to a banned domain.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bayarea) if you have any questions or concerns.*",
    "url": ""
  },
  {
    "text": "[Redwood Cycle House in Castro Valley](https://www.facebook.com/permalink.php?story_fbid=pfbid02UgYqp2fEBVaJCwShrv2VdzSMPsvH4rtFHfs1uAdK7bPhDjhfRN3LJaHKwm6SQUKFl&id=61571113811185)\n\nedit to add: Also Castro Valley Natural Grocery, who are amazing and are staying open but giving 5% back to local reputable charities Thanks for sharing, didn't realize CV had a shop like this. After checking out their website and services  (and seeing their support for the community), I will go out of my way to buy from this shop!",
    "url": ""
  },
  {
    "text": "What labor unions are participating? If we don't have them, this is not going to be a *General Strike*. [NATIONAL SHUTDOWN—FRI. JANUARY 30](https://nationalshutdown.org/home#endorsers)\n\nHere's a list of organizations that have endorsed the strike. I don't know if it's a complete list, but you can take a look Those aren't labor unions unfortunately. Speaking as a 25 year union member, if a general strike happens it will be without them.\n\nThe statements coming from the ones I've seen boil down to if someone is contracted to work on the 30th and they fail to report to work, they could be subjected to legal action for breach of contract. If you aren't working tomorrow then protest away.\n\nIt is what it is. Did u even bother to read the list? A student union is not the same as a labor union, and all the others are non-profits.",
    "url": ""
  },
  { "text": "Fiat lux in sf!", "url": "" },
  { "text": "Sacred Rose Tattoo in Berkeley", "url": "" },
  { "text": "Gameshop Downstairs in San Jose", "url": "" },
  {
    "text": "Make me holey in San Jose Oooh i have been thinking of getting a new piercing",
    "url": ""
  },
  {
    "text": "Are teachers/schools participating? I haven’t been able to tell. I ask because I usually sub in Fridays but if you’re not working I’m not working. I think some schools' students are planning walk outs. I'm not sure about teachers, though, and im not sure how many schools are actually participating",
    "url": ""
  },
  { "text": "Walden Pond Books - Oakland", "url": "" },
  {
    "text": "A novel affair in Los Altos. Black squirrel yarns in Berkeley.",
    "url": ""
  },
  { "text": "Royal Bee Yarn in Pacifica", "url": "" },
  { "text": "Bombera in Oakland", "url": "" }
]
