[
  {
    "text": "If you must shop tomorrow (1/30) during the Ice Out Nationwide Shutdown, support local businesses. I've seen several stand up to offer their support. This is nowhere near a comprehensive list, so please drop any you know of:\n\n\nCulture Coffee is offering a meeting place at 1 before the rallies at 2 p.m. They are also offering free lemonade. \n\nCaputo's is donating all proceeds up to $10,000 to the International Rescue Committee (supporting immigrants and refugees). \n\nUnder the Umbrella Bookstore is offering a meeting place after the rallies at 4 to share information on how to contact your representatives and build anti-ICE kits. ",
    "url": ""
  },
  {
    "text": "Baby’s Bagels is giving free bagels at the protest. Check their instagram page\n\nhttps://preview.redd.it/bwwe3tehhdgg1.jpeg?width=1179&format=pjpg&auto=webp&s=042a95cc85da26754cf84c2e7d2186601077ac74",
    "url": "https://preview.redd.it/bwwe3tehhdgg1.jpeg?width=1179&format=pjpg&auto=webp&s=042a95cc85da26754cf84c2e7d2186601077ac74"
  },
  {
    "text": "King’s English bookshop said people are invited to use the place as 3rd place with no expectation of spending money but if you choose to spend, they’ll donate a portion to a specific charity that I forget. It’s on their insta",
    "url": ""
  },
  {
    "text": "Ken Sanders getting in on the action too.\n\nhttps://preview.redd.it/onz6ulaoaegg1.jpeg?width=1320&format=pjpg&auto=webp&s=77a60577f91a3a95cbb335ccbd3a0f20d7ce4ffa",
    "url": "https://preview.redd.it/onz6ulaoaegg1.jpeg?width=1320&format=pjpg&auto=webp&s=77a60577f91a3a95cbb335ccbd3a0f20d7ce4ffa"
  },
  {
    "text": "Also, Laziz Kitchen\n\nhttps://preview.redd.it/oxswbqveyegg1.jpeg?width=1080&format=pjpg&auto=webp&s=0d6778fd8898c8945729acf7a4a9a187b5f2e781",
    "url": "https://preview.redd.it/oxswbqveyegg1.jpeg?width=1080&format=pjpg&auto=webp&s=0d6778fd8898c8945729acf7a4a9a187b5f2e781"
  },
  {
    "text": "Heads up. Lots of local businesses are shutting down for the protest too. So if you're favorite local shop is closed. High five them and visit them again next week. 100% this! Support local",
    "url": ""
  },
  {
    "text": "https://preview.redd.it/80dv9xdyqdgg1.jpeg?width=1206&format=pjpg&auto=webp&s=67b0a550858686c135aaffce07e18d50b6a4da73\n\nAlso Boba Guru!",
    "url": "https://preview.redd.it/80dv9xdyqdgg1.jpeg?width=1206&format=pjpg&auto=webp&s=67b0a550858686c135aaffce07e18d50b6a4da73"
  },
  {
    "text": "Mochi Kids (9th & 9th) is closed but open 11-1 for a sign making party: https://www.instagram.com/p/DUEz1LVAQj2/",
    "url": ""
  },
  {
    "text": "Found these:\n\nSugar House Coffee\n\nhttps://preview.redd.it/qwoooinjhegg1.jpeg?width=1079&format=pjpg&auto=webp&s=4645e0fb85690799b07c99d118175b111d29b1ea Legendarium:\n\nhttps://preview.redd.it/u3q7zs4ohegg1.jpeg?width=1080&format=pjpg&auto=webp&s=2f2a915440f41d8b9e60b58b363b8e1344a5c7a9",
    "url": "https://preview.redd.it/qwoooinjhegg1.jpeg?width=1079&format=pjpg&auto=webp&s=4645e0fb85690799b07c99d118175b111d29b1ea"
  },
  {
    "text": "https://preview.redd.it/p254a180efgg1.jpeg?width=1206&format=pjpg&auto=webp&s=43eef7e4ebd83153c4271b54a7a67ddaff6d9a50 Any additions to this list as of now? Any links to it?",
    "url": "https://preview.redd.it/p254a180efgg1.jpeg?width=1206&format=pjpg&auto=webp&s=43eef7e4ebd83153c4271b54a7a67ddaff6d9a50"
  },
  {
    "text": "https://preview.redd.it/2deccfyohfgg1.jpeg?width=1290&format=pjpg&auto=webp&s=caae3d5ffdbb353649cac3ca1de13a8f9f395b64\n\nAnother one for the list, tres gatos Their chai is the most amazing drink I’ve ever had.",
    "url": "https://preview.redd.it/2deccfyohfgg1.jpeg?width=1290&format=pjpg&auto=webp&s=caae3d5ffdbb353649cac3ca1de13a8f9f395b64"
  },
  {
    "text": "https://preview.redd.it/s43os1pmxdgg1.jpeg?width=1179&format=pjpg&auto=webp&s=96078d32a3c16c9b2ee930f61334bead8a45a30a",
    "url": "https://preview.redd.it/s43os1pmxdgg1.jpeg?width=1179&format=pjpg&auto=webp&s=96078d32a3c16c9b2ee930f61334bead8a45a30a"
  },
  {
    "text": "https://preview.redd.it/v5vos5w2afgg1.jpeg?width=1080&format=pjpg&auto=webp&s=737ae7d4ffbc7a3a70e0b91a4303214aa37f61e8\n\nMaven as well. And they are paying their employees while closed.",
    "url": "https://preview.redd.it/v5vos5w2afgg1.jpeg?width=1080&format=pjpg&auto=webp&s=737ae7d4ffbc7a3a70e0b91a4303214aa37f61e8"
  },
  {
    "text": "Momma Mendoza's Home Made has a Community Food Pantry. She is the other half of Salsitas Mendoza. Her husband is an immigrant. They are local and lovely. Their chips and salsa are delicious. This food pantry is a labor of love for her. If you have a need, she would love to help. If you'd like to donate that is also an option. \n\nhttps://bakesy.shop/b/momma-mendozas-home-made/category/community-pantry-for-anyone-in-need?fbclid=PAZXh0bgNhZW0CMTEAc3J0YwZhcHBfaWQMMjU2MjgxMDQwNTU4AAGnWrvlGgvaFZ1KRJEZoeyzI4UxrXMFSS5TI7Gl19xXLuK_Q0D14R7gxyx-5HY_aem_jzL6-UuQ_25ipCtfbI6T2A ++ to Momma Mendoza’s and Salsitas! Family owned business, such wonderful people, and the chips and salsa are so so so so good",
    "url": ""
  },
  {
    "text": "If you do have to shop tomorrow or are shopping at one of the local business donating profits please consider using cash or a debit card! Making credit card companies loose out on fees also contributes to the strike. 😇",
    "url": ""
  },
  {
    "text": "Craft cafe is open and has their craft supplies available for sign making",
    "url": ""
  },
  {
    "text": "If you’re in need of nicotine or encounter anyone who needs it, go to Smoke Break Huka Outlet! Owned by an immigrant and super knowledgeable staff.",
    "url": ""
  },
  {
    "text": "Buds Sandwiches (vegan) will be open and donating a percentage of proceeds to local grassroots orgs. Extremely common Bud's W. I'm so glad the best sandwich place happens to also be good people",
    "url": ""
  },
  { "text": "I will be stopping by Caputo's tomorrow.", "url": "" },
  {
    "text": "do not come to houston chicken on 9&9 ‼️‼️ Yes, boycott Savory Fund brands (Swig, Mo Bettahs, Houston TX Hot chicken) What's the word on that? Haven't found anything with cursory Google searches. Have they said anything against the cause or are they just not closing? I’m not saying we shouldn’t boycott them, and I’m all for it if it’s warranted of course! But I’d love more info on those businesses for sure ahead of tomorrow.",
    "url": ""
  },
  {
    "text": "https://preview.redd.it/tlak07jqkegg1.jpeg?width=1179&format=pjpg&auto=webp&s=47d4a7a323713aa7f91cd68ea205e7b7ff974be6\n\nSalt and Honey posted this for tomorrow.",
    "url": "https://preview.redd.it/tlak07jqkegg1.jpeg?width=1179&format=pjpg&auto=webp&s=47d4a7a323713aa7f91cd68ea205e7b7ff974be6"
  },
  {
    "text": "Sweet Hazel & Co will be open and is offering a free ice cream/candy/hot chocolate for people who are able to join in the protest 💛 https://preview.redd.it/c7vuw7vspegg1.jpeg?width=1080&format=pjpg&auto=webp&s=c7b0a0fe8b72906557e58d01ed0c0370ac6f8297",
    "url": ""
  },
  { "text": "Thank you Salt Lake City I love you.", "url": "" },
  {
    "text": "Sunroom coffee downtown\n\nhttps://preview.redd.it/n0mddfefydgg1.jpeg?width=1206&format=pjpg&auto=webp&s=373dacaba0788891144e3e6f601ab4ef3237d394",
    "url": "https://preview.redd.it/n0mddfefydgg1.jpeg?width=1206&format=pjpg&auto=webp&s=373dacaba0788891144e3e6f601ab4ef3237d394"
  },
  {
    "text": "Tea Zaanti will be closing early in support of the shut down",
    "url": ""
  },
  { "text": "Passion Flour on 900 S is donating 10% to ACLU", "url": "" },
  {
    "text": "I own several local retail businesses that would make great meeting and organization spaces of they are needed. Not sure who to speak to, but if anyone knows anyone looking lmk U/stephenforslc",
    "url": ""
  },
  {
    "text": "https://preview.redd.it/yb6nvf09pigg1.jpeg?width=1206&format=pjpg&auto=webp&s=583fde0372e544350904ab01063e7ba826549c8e",
    "url": "https://preview.redd.it/yb6nvf09pigg1.jpeg?width=1206&format=pjpg&auto=webp&s=583fde0372e544350904ab01063e7ba826549c8e"
  },
  { "text": "FYI: Under The Umbrella requires masks at all times.", "url": "" },
  {
    "text": "Where can I find out about times and places for upcoming protests in Utah? Ironically, this subreddit has already become a good way to get info, but if you’re looking for more, go to Instagram and follow as many protest and community organizations as you can, and anybody who frequently visits or photographs protests. Here are a few that I have.\n\nhttps://www.instagram.com/utahmarch\n\nhttps://www.instagram.com/mechadeuofu\n\nhttps://www.instagram.com/slc.mutualaid\n\nhttps://www.instagram.com/colvining_photography",
    "url": ""
  },
  {
    "text": "Solvi, Lovebound Library and Salt and Honey Market have all invited patrons to come without pressure to buy anything. Lovebound and Salt and Honey will provide materials for mailing letters and creating signs.\n\nIf you do buy, Solvi will donate 100% of their profits to Comunidades Unidas Utah. Lovebound and S&H will be donating portions to other similar organizations. https://preview.redd.it/nuufgyo9segg1.jpeg?width=1290&format=pjpg&auto=webp&s=34355d3d69aaf5c795b439071a24820c9e5bf727",
    "url": ""
  },
  { "text": "Does this mess with the shut down? If we shop local", "url": "" },
  {
    "text": "Can someone explain to me how local businesses shutting down for the strike attacks oligarchs and mega corporations where it hurts? I have a bad feeling that this is going to persuade consumers to give more money to the oligarch corporations If everything shuts down. If thousands of restaurants and stores and coffee shops shut down, the point-of-sale companies will see a drop in traffic, as will the banks that issue credit and debit cards. If people don’t go out to eat or shop, gas stations see a drop in sales. Etc. Capitalism notices these disruptions in the data. It’s one of the only ways we the masses have of getting their attention and exerting pressure on the political system.",
    "url": ""
  },
  {
    "text": "Any bars with food that are open and pledging? I have a friend laying over tonight from out of town and would like to grab a drink but my regular spots are either closed or have remained silent. I've been searching for a long time the only one I can find is Hopkins Brewery who is donating 10% to the IRC.",
    "url": ""
  },
  {
    "text": "Cozy Coffee Lounge is selling shirts and has a meetup at 1 before the protest at 2\n\nhttps://preview.redd.it/h0nlozadtegg1.jpeg?width=1290&format=pjpg&auto=webp&s=bc72de6dc3803f7eacd2c0cc37337a3703094500",
    "url": "https://preview.redd.it/h0nlozadtegg1.jpeg?width=1290&format=pjpg&auto=webp&s=bc72de6dc3803f7eacd2c0cc37337a3703094500"
  }
]
